import React, { Component } from 'react'
import IntBtn from '../IntBtn'
import PubSub from 'pubsub-js'
import axios from 'axios'
import './index.css'

export default class Speak extends Component {

    // 问题ID
    problemId = 1

    // 文本内容
    text = React.createRef()

    // 父问题
    parent = this.props.parent

    // 图案
    svg = {
        lineCode:'M5.5 5h1.866a.5.5 0 01.486.617l-.96 4a.5.5 0 01-.486.383H5.5a.5.5 0 01-.5-.5v-4a.5.5 0 01.5-.5zm8 0h1.866a.5.5 0 01.486.617l-.96 4a.5.5 0 01-.486.383H13.5a.5.5 0 01-.5-.5v-4a.5.5 0 01.5-.5z',
        blockCode:'M3.64 10.98c.147 0 .312-.022.495-.066.183-.044.348-.12.495-.23.147-.11.271-.269.374-.474.103-.205.154-.462.154-.77V5.084c0-.499.077-.928.231-1.287.154-.36.363-.66.627-.902s.565-.422.902-.539c.337-.117.69-.176 1.056-.176H9.58v1.848H8.37c-.425 0-.693.14-.803.418-.11.279-.165.58-.165.902v4.136c0 .425-.08.788-.242 1.09-.161.3-.352.545-.572.736-.22.19-.455.337-.704.44-.25.103-.462.161-.638.176v.044c.176.015.389.062.638.143.25.08.484.216.704.407.22.19.41.447.572.77.161.323.242.74.242 1.254v4.004c0 .323.055.623.165.902.11.279.378.418.803.418h1.21v1.848H7.974c-.367 0-.719-.059-1.056-.176a2.573 2.573 0 01-.902-.539 2.586 2.586 0 01-.627-.902c-.154-.36-.231-.788-.231-1.287V14.61c0-.352-.051-.638-.154-.858a1.494 1.494 0 00-.374-.517 1.18 1.18 0 00-.495-.253 2.143 2.143 0 00-.495-.066V10.98zm16.72 2.04c-.161 0-.33.022-.506.066a1.184 1.184 0 00-.484.253 1.494 1.494 0 00-.374.517c-.103.22-.154.506-.154.858v4.202c0 .499-.077.928-.231 1.287-.154.36-.363.66-.627.902a2.573 2.573 0 01-.902.54c-.337.116-.69.175-1.056.175H14.42v-1.848h1.21c.425 0 .693-.14.803-.418.11-.279.165-.58.165-.902v-4.004c0-.513.08-.931.242-1.254.161-.323.352-.58.572-.77.22-.19.455-.326.704-.407.25-.08.462-.128.638-.143v-.044a2.225 2.225 0 01-.638-.176 2.567 2.567 0 01-.704-.44c-.22-.19-.41-.436-.572-.737-.161-.3-.242-.664-.242-1.089V5.452c0-.323-.055-.623-.165-.902-.11-.279-.378-.418-.803-.418h-1.21V2.284h1.606c.367 0 .719.059 1.056.176.337.117.638.297.902.539.264.242.473.543.627.902.154.36.231.788.231 1.287v4.356c0 .308.051.565.154.77.103.205.227.363.374.473.147.11.308.187.484.231.176.044.345.066.506.066v1.936z',
        link:'M13 7a1 1 0 011-1h2a6 6 0 010 12h-2a1 1 0 110-2h2a4 4 0 000-8h-2a1 1 0 01-1-1zm-3 10a1 1 0 01-1 1H8A6 6 0 018 6h1a1 1 0 010 2H8a4 4 0 100 8h1a1 1 0 011 1zm-1-6h6a1 1 0 110 2H9a1 1 0 110-2z',
        ul:'M8 7a1 1 0 110-2h13a1 1 0 110 2H8zm0 6a1 1 0 110-2h13a1 1 0 110 2H8zm0 6a1 1 0 110-2h13a1 1 0 110 2H8zM2.952 6.85a1.201 1.201 0 111.698-1.7 1.201 1.201 0 01-1.698 1.7zm0 6a1.201 1.201 0 111.698-1.7 1.201 1.201 0 01-1.698 1.7zm0 6a1.201 1.201 0 111.698-1.7 1.201 1.201 0 01-1.698 1.7z',
        ol:'M7 6a1 1 0 011-1h13a1 1 0 110 2H8a1 1 0 01-1-1zm1 13a1 1 0 110-2h13a1 1 0 010 2H8zm0-6a1 1 0 110-2h13a1 1 0 010 2H8zM2.756 4.98l.236-1.18h2.22l-.92 4.6h-1.38l.684-3.42h-.84zm2.823 8.3l-.235 1.192H1.756l.174-.87.073-.117 1.911-1.498c.219-.178.368-.324.445-.434a.49.49 0 00.099-.287.208.208 0 00-.083-.18c-.067-.052-.176-.082-.335-.082a.897.897 0 00-.398.094 1.02 1.02 0 00-.342.272l-.12.144-.968-.702.118-.162c.193-.264.456-.473.786-.625.327-.15.684-.225 1.068-.225.318 0 .602.053.85.16.255.11.456.267.6.47.146.206.22.44.22.698 0 .298-.083.58-.247.839-.158.25-.424.518-.797.807l-.653.506h1.422zm-3.063 3.7l.245-1.18h3.345l-.166.867-.06.11-.93.869a1.205 1.205 0 01.737 1.144c-.001.327-.098.622-.29.881a1.856 1.856 0 01-.774.593c-.322.139-.685.208-1.087.208-.328 0-.636-.045-.924-.135a2.06 2.06 0 01-.743-.4l-.132-.114.688-1.05.173.147c.12.103.267.185.442.245.177.06.364.091.562.091.251 0 .435-.044.554-.124a.31.31 0 00.146-.282c0-.086-.025-.135-.08-.171-.076-.05-.213-.079-.41-.079h-.687l.173-.88.06-.108.674-.632H2.516z',
        at:'M15.424 15.2a4.62 4.62 0 11-.742-6.947 1 1 0 011.985.176v4.524a1.714 1.714 0 003.429 0v-.905a8.048 8.048 0 10-3.155 6.39 1 1 0 111.216 1.588 10.048 10.048 0 113.939-7.978v.905a3.714 3.714 0 01-6.672 2.247zm-3.376-.533a2.62 2.62 0 100-5.238 2.62 2.62 0 000 5.238z'
    }

    state={
        change1: 'strong',
        change2: 'weak'
    }
    // 添加代码
    add(code){
        this.text.current.value+=code;
    }

    //订阅题目ID（发布评论使用）
    componentDidMount(){
        PubSub.subscribe('problemId',(_,ID)=>{
            this.problemId = ID;
        })
    }

    // 提交评论
    pushComment=()=>{
        axios.post(`http://rap2api.taobao.org/app/mock/276533/leetcode/question/problemcomment?problemId=${this.problemId}&commentContent=${this.text.current.value}&parentId=${this.parent}&commentDatetime=${new Date()}`)
    }

    // 预览
    change=(event)=>{
        if(event.target.innerHTML===this.change1.innerHTML){
            this.setState({
                change1: 'strong',
                change2: 'weak'
            })
            this.text.current.readOnly=false;
        } else{
            this.setState({
                change1: 'weak',
                change2: 'strong'
            })
            this.text.current.readOnly=true;
        }
    }

    render() {
        return (
            <div id='speak'>
                <div id='box'>
                    <textarea id='textarea' ref={this.text} rows='2'/>
                </div>
                <div id='bar'>
                    <span id={this.state.change1} ref={c => this.change1=c} onClick={(event)=>this.change(event)}>编辑</span>
                    <span id={this.state.change2} ref={c => this.change2=c} onClick={(event)=>this.change(event)}>预览</span>
                    <span id='adds'>
                        <IntBtn type='black' svg={this.svg.lineCode} onClick={()=>this.add(' `your inline code...` ')}/>
                        <IntBtn type='black' svg={this.svg.blockCode} onClick={()=>this.add('\n```\ncode block\n```\n')}/>
                        <IntBtn type='black' svg={this.svg.link} onClick={()=>this.add('[力扣](https://leetcode-cn.com)')}/>
                        <IntBtn type='black' svg={this.svg.ul} onClick={()=>this.add('\n- 无序列表')}/>
                        <IntBtn type='black' svg={this.svg.ol} onClick={()=>this.add('\n1. 有序列表')}/>
                        <IntBtn type='black' svg={this.svg.at} onClick={()=>this.add('@')}/>
                    </span>
                    <span id='btns'>
                        <button onClick={this.props.cancel} style={{display:this.props.canCancel?'inline':'none'}} id='cancel'>取消</button>
                        <button onClick={this.pushComment} id='publish'>评论</button>
                    </span>
                </div>
            </div>
        )
    }
}
